#lang racket

(define (cube x) (* x x x))

(define (p x) (- (* 3 x) (* 4 (cube x))))

(define (sine angle)
(if (not (> (abs angle) 0.1))
  angle
  (p (sine (/ angle 3.0)))))
(sine 12.15)
; Pythonにて
; >>> 12.15/3.
; 4.05
; >>> 12.15/3/3
; 1.3499999999999999
; >>> 12.15/3/3/3
; 0.44999999999999996
; >>> 12.15/3/3/3/3
; 0.15
; >>> 12.15/3/3/3/3/3
; 0.049999999999999996
; pは5回呼ばれる
; オーダー
; a/3^n < 0.1となるnのうち最も大きいものを求めればよい
; a/3^n < 0.1 < a/3^(n-1)
; log a < n*log3, (n-1)*log3 < log a
; n-1 < log a / log3 < n
; オーダーは空間・時間ともにlog a?
